Autodesk.Revit.DB.ShapeImporterSourceFormat
An enumerated type listing the possible formats supported by the Shapeimporter.
Since:
2017
Since:
2017

Autodesk.Revit.DB.ShapeImporterSourceFormat.InventorAssembly
The incoming data is in Inventor-assembly format (*.iam).

Autodesk.Revit.DB.ShapeImporterSourceFormat.InventorPart
The incoming data is in Inventor-part format (*.ipt).

Autodesk.Revit.DB.ShapeImporterSourceFormat.Rhino
The incoming data is in Rhino format (*.3dm).

Autodesk.Revit.DB.ShapeImporterSourceFormat.SAT
The incoming data is in SAT format (*.sat).

Autodesk.Revit.DB.ShapeImporterSourceFormat.Auto
The format of the incoming data will be determined from input file extension.